configuration/Documents/fast8ПроверкаЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>fast8ПроверкаЗадания</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.fast8ИсторияВыполненияЗаданий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.fast8Задание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращеноНаДоработку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

configuration/InformationRegisters/fast8ИсторияВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>fast8ИсторияВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fast8СтатусыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Процессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.fast8Задание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/fast8СтатусыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>fast8СтатусыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращеноНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Documents/fast8ПроверкаЗадания/Ext/ObjectModule.bsl
// MIT License
//
// Copyright (c) 2023 FAST8.RU
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Исполнитель = ПредопределенноеЗначение("Справочник.fast8Пользователи.ПустаяСсылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.fast8ИсторияВыполненияЗаданий.СрезПоследних(
	|			&Период,
	|			Задание = &Задание
	|				И Процесс = &Процесс) КАК fast8ИсторияВыполненияЗаданийСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата - 1);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Исполнитель = Выборка.Исполнитель;
	КонецЕсли;
	
    Движения.fast8ИсторияВыполненияЗаданий.Записывать = Истина;
	
	Если ВозвращеноНаДоработку Тогда
		Движение = Движения.fast8ИсторияВыполненияЗаданий.Добавить();
		Движение.Регистратор	= Ссылка;
		Движение.Период			= Дата;
		Движение.Процесс		= Процесс;
		Движение.Задание		= Задание;
		Движение.Статус			= ПредопределенноеЗначение("Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку");
		Движение.Исполнитель	= Исполнитель;
		Движение.Проверяющий	= Проверяющий;
	КонецЕсли;
	
	Если Выполнено Тогда
		Движение = Движения.fast8ИсторияВыполненияЗаданий.Добавить();
		Движение.Регистратор	= Ссылка;
		Движение.Период			= Дата;
		Движение.Процесс		= Процесс;
		Движение.Задание		= Задание;
		Движение.Статус			= ПредопределенноеЗначение("Перечисление.fast8СтатусыЗаданий.Выполнено");
		Движение.Исполнитель	= Исполнитель;
		Движение.Проверяющий	= Проверяющий;
	КонецЕсли;
		
КонецПроцедуры // ПриЗаписи() 

#КонецОбласти // ОбработчикиСобытий
